# Используем официальный образ Node.js в качестве базового
FROM node:latest

# Создаем директорию приложения внутри контейнера
WORKDIR /usr/src/app

# Копируем зависимости приложения
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install
RUN npm install pm2 -g

# Копируем остальные файлы приложения в контейнер
COPY . .

# Определяем порт, который будет использоваться для доступа к приложению
EXPOSE 3000

# Запускаем приложение при помощи команды `npm start`
CMD ["pm2-runtime", "npm", "--", "start"]
